app/Http/Controllers/AdminCategoryController.php

    public function index()
    {
        $this->authorize('admin');

        return view('dashboard.categories.index', [
            'categories' => Category::all()
        ]);
---
SELECT * FROM `categories`