app/Http/Controllers/DashboardPostController.php

    public function index()
    {
        return view('dashboard.posts.index', [
            'posts' => Post::where('user_id', auth()->user()->id)->get()
        ]);
---
SELECT * FROM `posts` WHERE `user_id` = 7

    public function create()
    {
        return view('dashboard.posts.create', [
            'categories' => Category::all()
        ]);
---
SELECT * FROM `categories`

    public function edit(Post $post)
    {
        return view('dashboard.posts.edit', [
            'post' => $post,
            'categories' => Category::all()
        ]);
---
SELECT * FROM `categories`