app/Http/Controllers/PostController.php

    public function index()
    {
        $title = '';
        if (request('category')) {
            $category = Category::firstWhere('slug', request('category'));
            $title = ' in ' . $category->name;
        }

        if (request('author')) {
            $author = User::firstWhere('username', request('author'));
            $title = ' by ' . $author->name;
        }

        return view('posts', [
            "title" => "All Posts" . $title,
            "active" => "posts",
            "posts" => Post::latest()->filter(request(['search', 'category', 'author']))->paginate(5)->withQueryString()
---
SELECT * FROM `categories` WHERE `categories`.`id` in (1, 2)
SELECT * FROM `posts` ORDER BY `created_at` DESC LIMIT 5 offset 0
SELECT count(*) as aggregate FROM `posts`